//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
//
//  Конфигурация таймеров микроконтроллера STM32F10xxxx
//
//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

#ifndef PWM_H	// Блокирую повторное включение этого модуля
#define PWM_H

/*
 При аналоговjм режиме (через LM358) 1-ца CCR = 0.0118В ( 11,8мВ )
 При силовом режиме (через MOSFET) 1-ца CCR = 0.0242В ( 24,2мВ )
*/

// ==================================================

// Инициализация ШИМ
void PWM_Init(void);

// Включение PWM
void PWM_Enable(void);

// Выключение PWM
void PWM_Disable(void);

// Обновление пар-ов PWM
void PWM_Update(uint8_t Ch, uint16_t CCR);

#endif
//
//
